"""
    防止函数对列表进行修改
"""
import copy


def change_list(list1):
    print(f"2在函数体中修改前列表的值{list1},地址{id(list1)}") # 2在函数体中修改前列表的值[1, 2, 3],地址2308259580032
    list1[2] = 200
    print(f"3在函数体中修改后列表的值{list1},地址{id(list1)}") # 3在函数体中修改后列表的值[1, 2, 200],地址2308259580032


list2 = [1, 2, 3]

print(f"1在函数体外调用函数前列表的值{list2},地址{id(list2)}") # 1在函数体外调用函数前列表的值[1, 2, 3],地址2308256436608
change_list(list2[:] ) # list2[:] 与 list2.copy() 相同，浅拷贝，会创建一个新的列表对象
print(f"4在函数体外调用函数后列表的值{list2},地址{id(list2)}") # 4在函数体外调用函数后列表的值[1, 2, 3],地址2308256436608

print("*"*40)

def change_list2(list1):
    print(f"2在函数体中修改前列表的值{list1},地址{id(list1)}") # 2在函数体中修改前列表的值[10, 20, 30, [1, 2, 3]],地址2308258625280
    list1[3].append(400)
    print(f"3在函数体中修改后列表的值{list1},地址{id(list1)}") # 3在函数体中修改后列表的值[10, 20, 30, [1, 2, 3, 400]],地址2308258625280


list3 = [10, 20, 30, [1, 2, 3]]

print(f"1在函数体外调用函数前列表的值{list3},地址{id(list3)}") # 1在函数体外调用函数前列表的值[10, 20, 30, [1, 2, 3]],地址2308259581120
#change_list2(list3[:] ) # list3[:] 浅拷贝，创建了一个新的列表对象，但是这两个列表对象的第四个元素[1, 2, 3]是指向同一个地址，所以没有防住change_list2修改list3中的列表对象
change_list2(copy.deepcopy(list3)) # 深拷贝，list3列表中第四个列表对象也会重新创建，所以指向的是不同得知，change_list2就不会影响list3
print(f"4在函数体外调用函数后列表的值{list3},地址{id(list3)}") # 4在函数体外调用函数后列表的值[10, 20, 30, [1, 2, 3, 400]],地址2308259581120
